---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.FamilyOverconstraintCB
source: html/95fa2f83-5e87-4698-eb40-a96c739be1d4.htm
---
# Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.FamilyOverconstraintCB Property

Dimension overconstrains the Family.

## Syntax (C#)
```csharp
public static FailureDefinitionId FamilyOverconstraintCB { get; }
```